/* 1. Задать температуру в градусах по Цельсию.
Вывести в alert соответствующую температуру в градусах по Фаренгейту.
Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию
*/

var Tc = prompt("Введите температуру в цельсиях");
alert("Температура по Фаренгейту="+ (9/5 * Tc + 32));

/*2. Работа с переменными.
3. Объявить две переменные: admin и name.
Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывести «Василий»).
*/

var nam = promt("Введите ваше имя");
var admin;
admin = nam;
alert(admin);


//4. *Чему будет равно JS-выражение 1000 + "108"/

alert(1000 + "108");
// Выведет:1000108


//5. *Самостоятельно разобраться с атрибутами тега script (async и defer)

/* Атрибут defer говорит браузеру о том, что нужно продолжить загружать страницу, а только потом уже загрузить этот скрипт. Атрибут asynk, как я понял,
запустит то, что загрузиться в первую очередь */


//Дополнительное задание
var a = 10;
var b = 5;
a = a + b;
b = a - b;
a = a - b;
alert(a);
alert(b);


