/*1. Дан код:

var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2
d = b++; alert(d);           // 1
c = (2+ ++a); alert(c);      // 5
d = (2+ b++); alert(d);      // 4
alert(a);                    // 3
alert(b);                    // 3

Почему код даёт именно такие результаты?*/

/*
1)прибавляется единица и выводится результат.
2)сначала выводится результат, а только потом уже прибавляется единица. То есть компьютер как бы засчитывает это действие, но не выводит его.
3)2 + (++2) = 2 + (1 + 2) = 5
4)2 + 2 = 4. Не засчитывает прибавление единицы. То есть мы b переопределили, но к сумме все равно прибавили два.
5)a = 3
6)b = 3 Обе переменные переопределены. */


/*2. Чему будет равен x в примере ниже?

var a = 2;
var x = 1 + (a *= 2);

x = 1 + (a *= 2) = 1 + 4 = 5
*/

/*3. Объявить две целочисленные переменные a и b и задать им произвольные начальные значения. Затем написать скрипт, который работает по следующему принципу:

    если a и b положительные, вывести их разность;
    если а и b отрицательные, вывести их произведение;
    если а и b разных знаков, вывести их сумму; ноль можно считать положительным числом.
*/

var a = +prompt ("Введите первое число: ");
var b = +prompt ("Введите второе число: ");
if ( a >= 0 && b >= 0) {
    alert(a - b);
}
else if (a < 0 && b < 0) {
    alert(a * b);
}
else {
    alert(a + b);
}

/*4. Присвоить переменной а значение в промежутке [0..15]. С помощью оператора switch организовать вывод чисел от a до 15.*/

var a = +prompt("Введите значение от 0 до 15: ");
switch (a) {
   case a = 1:
       console.log(1);
    case a = 2:
        console.log(2);
    case a = 3:
        console.log(3);
    case a = 4:
        console.log(4);
    case a = 5:
        console.log(5);
    case a = 6:
        console.log(6);
    case a = 7:
        console.log(7);
    case a = 8:
        console.log(8);
    case a = 9:
        console.log(9);
    case a = 10:
        console.log(10);
    case a = 11:
        console.log(11);
    case a =12:
        console.log(12);
    case a = 13:
        console.log(13);
    case a = 14:
        console.log(14);
    case a = 15:
        console.log(15);
        break;
    default:
        console.log("Вы ввели число не удовлетворяющие условие")
    
}

/*5. Реализовать основные 4 арифметические операции в виде функций с двумя параметрами. Обязательно использовать оператор return.*/

var a = +prompt("Введите первое число: ");
var b = +prompt("Введите второе число: ");
function sum(a, b) {
    return a + b;
}
function min(a, b) {
    return a - b;
}
function zv(a, b) {
    return a *b;
}
function cv(a, b) {
    return a/b;
}
alert(sum(a, b));
alert(min(a, b));
alert(zv(a, b));
alert(cv(a, b));

/* 6. Реализовать функцию с тремя параметрами: function mathOperation(arg1, arg2, operation),
где arg1, arg2 – значения аргументов, operation – строка с названием операции.
В зависимости от переданного значения операции выполнить одну из арифметических операций (использовать функции из пункта 3) и вернуть
полученное значение (использовать switch). */

var a = +prompt("Введите первое число: ");
var b = +prompt("Введите второе число: ");
var operation = prompt("Введите знак операции");
function mathOperation(a, b, operation) {
    switch (operation) {
        case "+":
           return a + b;
        case "-":
            return a - b;
        case "*":
            return a * b;
        case "/":
            return a / b;
        default:
            console.log("Вы ввели не корректный знак");

    }
}
alert(mathOperation(a, b, operation));

//Сравнить null и 0. Попробуйте объяснить результат.
/* 0 - это конкретное значение, а null это не значение. Так обозначается например то, что может быть не указано. */
