/*1. Написать функцию, преобразующую число в объект.
Передавая на вход число от 0 до 999, мы должны получить на выходе объект, в котором в соответствующих свойствах описаны единицы, десятки и сотни.
Например, для числа 245 мы должны получить следующий объект: {‘единицы’: 5, ‘десятки’: 4, ‘сотни’: 2}.
Если число превышает 999, необходимо выдать соответствующее сообщение с помощью console.log и вернуть пустой объект. */

var obj = {
    hundreds: 0,
     dozens: 0,
     units: 0
};
function f(n){
    if (n > 999){
        console.log("Введенное число больше 999");
    }
    else {
        obj.units = n % 10;
        obj.dozens = parseInt((n % 100) / 10);
        obj.hundreds =parseInt(n / 100) ;
    }
    return obj;
}
var x = +prompt("Введите число от 0 до 999");
console.log(f(x));
document.write("единицы: "+obj.units+ " десятки: "+obj.dozens+ " сотни: "+obj.hundreds);

